#include <iostream>
#include <vector>
#include <cstdlib>
#include <ctime>
#include <thread>
#include <chrono>
#include<windows.h>
#include <conio.h>
using namespace std;
void Plot4()
{
    cout<<"Max:”天啊，这次旅行真的让我很沮丧，就没有地方有人活下来吗“\n\n";
    Sleep(3000);
    cout<<"Charlie:”当然有了，真正有钱的人，0.01%富裕到令人发指的人类，决定他们需要一个全新的星球”\n\n";
    Sleep(3000);
    cout<<"Max:“你是说他们去了火星？那剩下99.99%的人类呢”\n\n";
    Sleep(3000);
    cout<<"一个机器人按下一个醒目的名叫“周边整肃”的红色按钮\n\n";
    Sleep(3000);
    system("cls");
    cout<<"Charlie:“太棒了”\n\n";
    Sleep(3000);
    cout<<"显而易见的，四周的无死角喷火武器指向防护围栏，尽管围栏挂着的只有骨头，围栏下堆着的也只有骨头\n\n";
    
    Sleep(3000);
    cout<<R"("                 /\ \n"+
"                 || \n"+
"                ==== \n"+
"                |  | \n"+
"                |  | \n"+
"                ==== \n"+
"                XXXX \n"+
"                |\/| \n"+
"                |/\| \n"+
"                |\/| \n"+
"                |/\| \n"+
"                |\/| \n"+
"                |/\| \n"+
"               /____\ \n"+
"               |    | \n"+
"               |    | \n"+
"              /      \ \n"+
"             /        \ \n"+
"            /          \ \n"+
"           /            \ \n"+
"          /              \ \n"+
"          ---------------- \n"+
"          |--------------| \n"+
"          |              | \n"+
"          |              | \n"+
"          |     ____     | \n"+
"          |     |   _    | \n"+
"          |     |___|    | \n"+
"          |     ____     | \n"+
"          |     |__      | \n"+
"          |     |___     | \n"+
"          |     ___      | \n"+
"          |     |__]     | \n"+
"          |     |  \     | \n"+
"          |     ___      | \n"+
"          |     |__]     | \n"+
"          |     |__]     | \n"+
"          |              | \n"+
"          |       I      | \n"+
"          |       I      | \n"+
"          |       I      | \n"+
"          |              | \n"+
"          |     |        | \n"+
"          |     |___     | \n"+
"          |              | \n"+
"          |              | \n"+
"          |              | \n"+
"          |       _      | \n"+
"          |      /|      | \n"+
"          |       |      | \n"+
"          |     __|__    | \n"+
"          |              | \n"+
"          |      __      | \n"+
"         /|      ||      |\ \n"+
"        / |      ||      | \ \n"+
"       /  |      ||      |  \ \n"+
"      /   |      ||      |   \ \n"+
" -----    |      HH      |    ----- \n"+
" |   |    |      HH      |    |   | \n"+
" |   |    |      HH      |    |   | \n"+
" |   |    |      HH      |    |   | \n"+
" |   |    |______HH______|    |   | \n"+
" --------/       HH       \-------- \n";)";
    cout<<"Charlie:“精英阶层并不赞同其他阶层的担忧”\n\n";
    Sleep(3000);
    cout<<"Max:“好吧，但是火星，那里死气沉沉的，没有生命。他们本可以用建造宇宙飞船的钱挽救他们所在的星球”\n\n";
    Sleep(3000);
    cout<<"Charlie:“我不想这么说，但人类是最糟糕的”\n\n";
    Sleep(3000);
    cout<<"Charlie:“人类有所有的工具可以治愈他们受伤的星球并拯救自己，但他们却选择了贪婪和自我满足，而不是打造一个健康的生物圈为子女的未来着想”\n\n";
    Sleep(3000);
    cout<<"尽管如此，作为人类精英的你，为了逃离地球去往火星的人类数量最大化，你该如何做出最好的选择,才能让更多人免于死亡----\n\n";
    Sleep(3000);
}