#include <iostream>
#include <vector>
#include <cstdlib>
#include <ctime>
#include <thread>
#include <chrono>
#include<windows.h>
#include <conio.h>
using namespace std;
void Plot3()
{
    cout<<"Charlie:”所以说，如果这些科技行业百万富翁只要多一点点社会包容性，他们是不是就能活下去？“\n\n";
    Sleep(3000);
    cout<<"Max:”啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈“\n\n";
    Sleep(3000);
    cout<<"Charlie:”啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈“\n\n";
    Sleep(3000);
    cout<<"Lily:”啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈“\n\n";
    Sleep(3000);
    cout<<"Max”但他们没有机会啦“\n\n";
    Sleep(3000);
    cout<<"Charlie:”再见，艾拉“\n\n";
    Sleep(3000);
    cout<<"“再见，三位来访者”她鞠了一躬\n\n";
    Sleep(3000);
    system("cls");
    cout<<".........\n\n";
    Sleep(3000);
    cout<<"在静谧的雪山下,一个堡垒的大门紧锁\n\n";
    Sleep(3000);
    cout<<R"(" \n"+
"                   ____ \n"+
"                 /  @   \==]|[=(]       E X T E R M I N A T E ! ! \n"+
"                |--------| \n"+
"                ==========       .  *                                     * \n"+
"                ==========     .\ * . *.   *                         .    * \  . \n"+
"               ||||||||||||      \ * ./  *    .   *                      .  \ \ \n"+
"              |||||||||| --]%%%%%% .- =--=---=-=-=-=--=-=--=-==-----=-=-=-=-=-= \n"+
"              [=========\  ]===========(  *                             . /  / \n"+
"             [==============|   / *  \    .                          *  *   /  . \n"+
"             C| @ @ @ @ @ @ D         *      *                        * \n"+
"              |              \           .                          *  * \n"+
"            C| @  @ @  @ @ @  D       . \n"+
"             |                 \          *                          * \n"+
"           C| @  @  @  @  @  @  D \n"+
"            |                    \  \n"+
"          C| @  @  @   @   @   @  D \n"+
"           |                       \ \n"+
"          |@@@@@@@@@@@@@@@@@@@@@@@@@| \n"+
"           -------------------------          \n"+)";
Sleep(5000);
system("cls");
    cout<<"Lily:“记录显示，当世界经济开始崩溃后，人类领袖们撤到这些坚不可摧的堡垒里，在地下等到混乱结束，再出来重整世界秩序”\n\n";
    Sleep(3000);
    cout<<"Charlie“看啊！超级大国的最后据点“\n\n";
    Sleep(3000);
    cout<<"电闸拉开，电灯正好打亮圆桌上用盘子盛着的人体上半的骸骨\n\n";
    Sleep(3000);
    cout<<R"("/\ \n"+
"||_____-----_____-----_____ \n"+
"||   O                  O  \ \n"+
"||    O\\    ___    //O    / \n"+
"||       \\ /   \//        \ \n"+
"||         |_O O_|         / \n"+
"||          ^ | ^          \ \n"+
"||        // UUU \\        / \n"+
"||    O//            \\O   \ \n"+
"||   O                  O  / \n"+
"||_____-----_____-----_____\ \n"+
"|| \n"+
"||. \n";)";
system("pause");
system("cls");
    cout<<"Max:”哦，是自助餐“\n\n";
    Sleep(3000);
    cout<<"Lily:”这个报告显示，当一种真菌摧毁了他们的第一批庄稼后，他们的自我维持水培系统开始出现故障。饥荒出现，幸存者转而使用一种他们称之为‘极端民主’的做法“\n\n";
    Sleep(3000);
    cout<<"”今晚选举获胜的是农业部部长“这是一个军帽里的纸条被机器人分析出来的结果\n\n";
    Sleep(3000);
    cout<<"而实际上你们每个晚上都开展了一场概率赌博游戏，在这其中，'要么在餐桌旁,要么在菜单上'你作为一个实力超群的领袖,极尽全力成为了每晚的选举输家————\n\n";
    Sleep(3000);
    cout<<"\n\n";
    Sleep(3000);
    system("pause");
}